---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.RailingDoublyConnected
source: html/8298e3dd-5489-350b-5ef6-aa8c4d7cce37.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.RailingDoublyConnected Property

Railings hosted on Stairs must form a single, open, connected line.

## Syntax (C#)
```csharp
public static FailureDefinitionId RailingDoublyConnected { get; }
```